In [1]:
import numpy as np
import pandas as pd
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [2]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [3]:
df.fillna(value="sports")

        A       B  C
0       1       5  1
1       2  sports  2
2  sports  sports  3

In [8]:
df.fillna(value=df['A'].mean(),axis=1)

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [ ]:
df['A'].fillna(value=df['A'].mean())

In [6]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
import pandas as pd
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                 index=[0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [17]:
import pandas as pd
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7'],
                 'D':['D4','D5','D6','D7']},
                 index=[4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [16]:
import pandas as pd
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                 'C':['C8','C8','C10','C11'],
                 'D':['D8','D9','D10','D11']},
                 index=[8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C8   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [21]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C8   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [19]:
pd.concat([df1,df2,df3],axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C8   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [20]:
left=pd.DataFrame()

In [29]:
left=pd.DataFrame({'key':['k0','k1','k2','k3'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7']})
right=pd.DataFrame({'key':['k0','k1','k1','k3'],
                   'D':['D4','D5','D6','D7'],
                  'E':['E4','E5','E6','E7']})
left
right

    D   E key
0  D4  E4  k0
1  D5  E5  k1
2  D6  E6  k1
3  D7  E7  k3

In [30]:
pd.merge(left,right,how='inner',on='key')

    B   C key   D   E
0  B4  C4  k0  D4  E4
1  B5  C5  k1  D5  E5
2  B5  C5  k1  D6  E6
3  B7  C7  k3  D7  E7

In [32]:
pd.merge(left,right,how='outer',on='key')

    B   C key    D    E
0  B4  C4  k0   D4   E4
1  B5  C5  k1   D5   E5
2  B5  C5  k1   D6   E6
3  B6  C6  k2  NaN  NaN
4  B7  C7  k3   D7   E7

In [31]:
pd.merge(left,right,how='left',on='key')

    B   C key    D    E
0  B4  C4  k0   D4   E4
1  B5  C5  k1   D5   E5
2  B5  C5  k1   D6   E6
3  B6  C6  k2  NaN  NaN
4  B7  C7  k3   D7   E7

In [34]:
left1=pd.DataFrame({'key1':['k0','k0','k1','k2'],
                    'key2':['k0','k1','k0','k1'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3']})
right1=pd.DataFrame({'key1':['k0','k1','k1','k2'],
                     'key2':['k0','k0','k0','k0'],
                   'D':['D0','D1','D2','D3'],
                  'E':['E0','E1','E2','E3']})
pd.merge(left1,right1,on=['key1','key2'])

    B   C key1 key2   D   E
0  B0  C0   k0   k0  D0  E0
1  B2  C2   k1   k0  D1  E1
2  B2  C2   k1   k0  D2  E2

In [37]:
left=pd.DataFrame({'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7']},
                 index=['k0','k1','k2','k3'])
right=pd.DataFrame({'D':['D4','D5','D6','D7'],
                  'E':['E4','E5','E6','E7']},
                 index=['k0','k0','k2','k3'])
left.join(right,how='outer')

     B   C    D    E
k0  B4  C4   D4   E4
k0  B4  C4   D5   E5
k1  B5  C5  NaN  NaN
k2  B6  C6   D6   E6
k3  B7  C7   D7   E7

In [59]:
import numpy as np
import pandas as pd
from numpy.random import randint
df=pd.DataFrame(randint(40,100,35).reshape(7,5),index='A B C D E F G'.split(),columns='Phy Chem Maths Comp Eng'.split())
print(df)

   Phy  Chem  Maths  Comp  Eng
A   59    60     93    53   61
B   73    99     96    85   54
C   91    57     74    54   66
D   72    83     76    63   90
E   84    50     81    61   57
F   86    66     42    80   58
G   96    72     54    56   84

In [53]:
df.iloc[1,0]="NaN"

In [54]:
df

   Phy  Chem  Maths  Comp
A   98    53     81    57
B  NaN    59     99    52
C   54    54     53    61
D   47    47     90    50
E   70    96     81    40
F   48    53     66    52
G   93    64     49    70

In [60]:
df.iloc[1,2]="NaN"
df.iloc[2,3]="Sports"
df.iloc[3,2]="NaN"
df.iloc[4,1]="Sports"
df.iloc[4,3]="Sports"
df.iloc[6,1]="NaN"
df.iloc[6,3]="NaN"

In [56]:
df

   Phy    Chem Maths    Comp
A   98      53    81      57
B  NaN      59   NaN      52
C   54      54    53  Sports
D   47      47   NaN      50
E   70  Sports    81  Sports
F   48      53    66      52
G   93     NaN    49     NaN

In [61]:
df.iloc[0,0]="Sports"
df.iloc[0,2]="NaN"
df.iloc[0,3]="NaN"

In [62]:
df

      Phy    Chem Maths    Comp  Eng
A  Sports      60   NaN     NaN   61
B      73      99   NaN      85   54
C      91      57    74  Sports   66
D      72      83   NaN      63   90
E      84  Sports    81  Sports   57
F      86      66    42      80   58
G      96     NaN    54     NaN   84

In [65]:
df.iloc[2,0]="Sports"

In [66]:
df

      Phy    Chem Maths    Comp  Eng
A  Sports      60   NaN     NaN   61
B      73      99   NaN      85   54
C  Sports  Sports    74  Sports   66
D      72      83   NaN      63   90
E      84  Sports    81  Sports   57
F      86      66    42      80   58
G      96     NaN    54     NaN   84

In [68]:
df.iloc[0,0]="NaN"

In [69]:
df

      Phy    Chem Maths    Comp  Eng
A     NaN      60   NaN     NaN   61
B      73      99   NaN      85   54
C  Sports  Sports    74  Sports   66
D      72      83   NaN      63   90
E      84  Sports    81  Sports   57
F      86      66    42      80   58
G      96     NaN    54     NaN   84

In [72]:
for x in range(7):
    for y in range(4):
        if(df.iloc[x,y]=="NaN"):
            df.iloc[x,y]=0
        if(df.iloc[x,y]=="Sports"):
            for z in range

In [ ]:
df